ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "X"
    input: "scale"
    output: "Y"
    name: "SimplifiedLayerNorm"
    op_type: "SimplifiedLayerNormalization"
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 1e-5
      type: FLOAT
    }
    attribute {
      name: "stash_type"
      i: 1
      type: INT
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 4
    data_type: 1
    name: "scale"
    float_data: 0.1
    float_data: 0.2
    float_data: 0.3
    float_data: 0.4
  }
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
