ir_version: 6
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "input"
    input: "skip"
    input: "gamma"
    output: "out"
    name: "SkipSimplifiedLayerNorm"
    op_type: "SkipSimplifiedLayerNormalization"
    attribute {
      name: "epsilon"
      f: 1e-12
      type: FLOAT
    }
    domain: "com.microsoft"
  }
  name: "torch-jit-export"
  initializer {
    dims: 4
    data_type: 1
    name: "gamma"
    float_data: 0.3
    float_data: 0.2
    float_data: 4.0
    float_data: 2.2
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "skip"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "out"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
opset_import {
  domain: "com.microsoft"
  version: 1
}
